/* eslint-disable import/no-cycle */
/* eslint-disable import/namespace */
/* eslint-disable import/prefer-default-export */
import {
  jobCal, typeJobPic, jobFilter, kokoroFit,
} from '../slices/draque';

export type colorKind1 = '赤' | '青' | '紫' | '黄' | '緑'

export const JobPic:typeJobPic = {
  バトルマスター: {
    1: '赤',
    2: '赤',
    3: '赤',
    4: '虹',
  },
  パラディン: {
    1: '赤',
    2: '青',
    3: '黄',
    4: '赤',
  },
  レンジャー: {
    1: '赤',
    2: '紫',
    3: '赤',
    4: '緑',
  },
  賢者: {
    1: '虹',
    2: '虹',
    3: '赤',
    4: '赤',
  },
  魔法戦士: {
    1: '',
    2: '',
    3: '',
    4: '',
  },
  海賊: {
    1: '',
    2: '',
    3: '',
    4: '',
  },
  スーパースター: {
    1: '',
    2: '',
    3: '',
    4: '',
  },
};

export const jobCalc:jobCal = {
  バトルマスター: {
    1: {
      紫: 1,
      赤: 1.2,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1,
      赤: 1.2,
      黄: 1,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1.2,
      黄: 1,
      青: 1,
      緑: 1,
    },
  },
  パラディン: {
    1: {
      紫: 1,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1.2,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
  },
  レンジャー: {
    1: {
      紫: 1,
      赤: 1.2,
      黄: 1,
      青: 1.2,
      緑: 1,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1.2,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1.2,
      緑: 1,
    },
  },
  賢者: {
    1: {
      紫: 1.2,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1.2,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1.2,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1.2,
    },
    4: {
      紫: 1.2,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1.2,
    },
  },
  魔法戦士: {
    1: {
      紫: 1.2,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1.2,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1.2,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
  },
  海賊: {
    1: {
      紫: 1,
      赤: 1,
      黄: 1.2,
      青: 1.2,
      緑: 1,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1.2,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1.2,
      緑: 1,
    },
  },
  スーパースター: {
    1: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1.2,
      緑: 1.2,
    },
    2: {
      紫: 1.2,
      赤: 1.2,
      黄: 1.2,
      青: 1.2,
      緑: 1.2,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1.2,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1.2,
    },
  },
};

type JobFavarite={
  [P in jobFilter]:{
    [K in kokoroFit]:string
  }
}

export const JobFavariteTeisu:JobFavarite = {
  バトルマスター: {
    1: '赤・黄',
    2: '虹',
    3: '赤',
    4: '赤',
  },
  パラディン: {
    1: '黄・緑',
    2: '虹',
    3: '黄',
    4: '黄',
  },
  レンジャー: {
    1: '赤・青',
    2: '虹',
    3: '青',
    4: '青',
  },
  賢者: {
    1: '紫・緑',
    2: '虹',
    3: '紫・緑',
    4: '紫・緑',
  },
  魔法戦士: {
    1: '黄・紫',
    2: '虹',
    3: '黄・紫',
    4: '黄・紫',
  },
  海賊: {
    1: '黄・青',
    2: '虹',
    3: '黄',
    4: '青',
  },
  スーパースター: {
    1: '青・緑',
    2: '虹',
    3: '青',
    4: '緑',

  },
};

export const JobFavaritePic:JobFavarite = {
  バトルマスター: {
    1: 'redBlue.png',
    2: 'reinbow.png',
    3: 'red.png',
    4: 'red.png',
  },
  パラディン: {
    1: 'yellowGreen.png',
    2: 'reinbow.png',
    3: 'yellow.png',
    4: 'yellow.png',
  },
  レンジャー: {
    1: 'redBlue.png',
    2: 'reinbow.png',
    3: 'blue.png',
    4: 'blue.png',
  },
  賢者: {
    1: 'purpleGreen.png',
    2: 'reinbow.png',
    3: 'purpleGreen.png',
    4: 'purpleGreen.png',
  },
  魔法戦士: {
    1: 'yellowPurple.png',
    2: 'reinbow.png',
    3: 'yellowPurple.png',
    4: 'yellowPurple.png',
  },
  海賊: {
    1: 'yellowBlue.png',
    2: 'reinbow.png',
    3: 'yellow.png',
    4: 'blue.png',
  },
  スーパースター: {
    1: 'blueGreen.png',
    2: 'reinbow.png',
    3: 'blue.png',
    4: 'Green.png',

  },
};
