/* eslint-disable import/no-cycle */
/* eslint-disable import/namespace */
/* eslint-disable import/prefer-default-export */
import {
  jobCal, typeJobPic, jobFilter, kokoroFit,
} from '../slices/draque';

export type colorKind1 = '赤' | '青' | '紫' | '黄' | '緑'

export const JobPic:typeJobPic = {
  バトルマスター: {
    1: '赤',
    2: '赤',
    3: '赤',
    4: '虹',
  },
  パラディン: {
    1: '赤',
    2: '青',
    3: '黄',
    4: '赤',
  },
  レンジャー: {
    1: '赤',
    2: '紫',
    3: '赤',
    4: '緑',
  },
  賢者: {
    1: '虹',
    2: '虹',
    3: '赤',
    4: '赤',
  },
};

export const jobCalc:jobCal = {
  バトルマスター: {
    1: {
      紫: 1,
      赤: 1.2,
      黄: 1,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 2,
      赤: 1.2,
      黄: 1,
      青: 1,
      緑: 1,
    },
    3: {
      紫: 1,
      赤: 1.2,
      黄: 1,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 10,
      黄: 1,
      青: 1,
      緑: 1,
    },
  },
  パラディン: {
    1: {
      紫: 1,
      赤: 1.25,
      黄: 1,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 1,
      赤: 1,
      黄: 1.25,
      青: 1.25,
      緑: 1,
    },
    3: {
      紫: 1.25,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1.25,
      赤: 1.25,
      黄: 1.25,
      青: 1.25,
      緑: 1,
    },
  },
  レンジャー: {
    1: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
  },
  賢者: {
    1: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    2: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    3: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
    4: {
      紫: 1,
      赤: 1,
      黄: 1,
      青: 1,
      緑: 1,
    },
  },
};

type JobFavarite={
  [P in jobFilter]:{
    [K in kokoroFit]:string
  }
}

export const JobFavariteTeisu:JobFavarite = {
  バトルマスター: {
    1: '赤・黄',
    2: '12',
    3: '13',
    4: '14',
  },
  パラディン: {
    1: '緑',
    2: '赤',
    3: '虹虹虹',
    4: '青',
  },
  レンジャー: {
    1: '紫',
    2: '赤',
    3: '青',
    4: '',
  },
  賢者: {
    1: '緑',
    2: '紫',
    3: '赤',
    4: '',
  },
};

export const JobFavaritePic:JobFavarite = {
  バトルマスター: {
    1: '赤・黄',
    2: '12',
    3: '13',
    4: '14',
  },
  パラディン: {
    1: '緑.png',
    2: '緑.png',
    3: '緑.png',
    4: '赤黄.png',
  },
  レンジャー: {
    1: '赤黄.png',
    2: '赤黄.png',
    3: '赤黄.png',
    4: '赤黄.png',
  },
  賢者: {
    1: '緑',
    2: '紫',
    3: '赤',
    4: '',
  },
};
